cost = int(input("Введите сумму счёта за обед: "))
tax1 = 15
tax2 = 20
firsttax = cost / 100 * tax1
secondtax = cost / 100 * tax2
print(firsttax)
print(secondtax)
#Напишите проrрамму «Щедрый посетитель», в окно которой пользователь сможет ввести сумму счета за обед 
#в ресторане. Программа должна выводить два значения: чаевые из расчета 15 и 20 % от указанной суммы. 