Name = "\t\t\t\t\t\tЛюбимые блюда"
print(Name.title())
Dish1 = input("Напиши своё первое любимое блюдо: " )
Dish2 = input("Напиши своё второе любимое блюдо: " )
print(Dish1 + Dish2 + " - Это твоё новое любимое блюдо")
#Напишите программу, в окно которой пользователь сможет ввести названия двух своих любимых блюд. 
#Программа должна щеплять две эти строки и выводить полученную строку как название нового невиданного 
#блюда.