message=str(input("Введите слово: "))
print("новый текст: ",message[::-1])
# Напишите проrрамму, которая принимала бы текст из попьзовательского ввода и печатала этот текст на экране наоборот. 