import random
print("Я ощущаю вашу энергетику. От моего экрана не скрыто ни одно из ваших чувств.") 
print("Итaк. ваше настроение ... ") 
mood = random.randint(1, 3) 
if mood == 1:
    print("""
-----------
|         |         
|  о  о   |
|   <     |
|         |
| .     . |
| ' ... ' |
-----------
""")
elif mood == 2:
    print("""
    -----------
    |         |
    |  o  o   |
    |   <     |
    |         |
    |  ----   |
    |         |
    -----------
    """)
elif mood == 3:
    print("""
    -----------
    |         |
    |  o  o   |
    |   <     |
    |   '     |
    |  ' '    |
    | '   '   |
    -----------
    """)